
read_verilog paraser.v

hierarchy -check -top \partoserial

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog paraserEst.v
