
read_verilog serializacion.v

hierarchy -check -top \serializacion

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog serializacionEst.v
